# IdeaStatiCa.ConnectionApi.Model.ConMemberPosition

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**DefinedBy** | **ConMemberPlacementDefinitionTypeEnum** |  | [optional]
**Origin** | **Vector3D** |  | [optional]
**AxisX** | **Vector3D** |  | [optional]
**AxisY** | **Vector3D** |  | [optional]
**AxisZ** | **Vector3D** |  | [optional]
**BetaDirection** | **double?** |  | [optional]
**GamaPitch** | **double?** |  | [optional]
**AlphaRotation** | **double** |  | [optional]
**OffsetEx** | **double** |  | [optional]
**OffsetEy** | **double** |  | [optional]
**OffsetEz** | **double** |  | [optional]
**Align** | **ConMemberAlignmentTypeEnum** |  | [optional]
**AlignedPlate** | **ConAlignedPlate** |  | [optional]
**RelatedPlate** | **ConAlignedPlate** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)